
&НаКлиенте
Процедура ВывестиСообщение(Команда)
	
	Сообщить("Привет, мир!");
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждение(Команда)
	
	Предупреждение("Привет, мир!", 5, "Наш заголовок");
	Сообщить("Привет, мир!");
	
КонецПроцедуры


&НаКлиенте
Процедура ПриветМир(Команда)
	
	А = 10;
	В = "Текст";
	//@skip-check undefined-function-or-procedure
	Предупреждение("Привет, мир!!!");
	
КонецПроцедуры
// @strict-types


#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
